tests/xml/SalesInvoices/insert-sales-invoice-result-1.xml

<salesinvoice result="1">
	<header>
		<invoicetype>FACTUUR</invoicetype>
		<customer>1000</customer>
		<status>concept</status>
		<paymentmethod>cash</paymentmethod>
		<headertext></headertext>
		<footertext></footertext>
		<office>11024</office>
		<invoicedate>20150924</invoicedate>
		<duedate>20151024</duedate>
		<period>2015/9</period>
		<currency>EUR</currency>
		<bank>BNK</bank>
		<invoiceaddressnumber>1</invoiceaddressnumber>
		<deliveraddressnumber>1</deliveraddressnumber>
		<invoicenumber>95</invoicenumber>
	</header>
	<lines>
		<line id="1">
			<quantity>1</quantity>
			<article>001</article>
			<description>DISCOUNT</description>
			<freetext1></freetext1>
			<freetext2></freetext2>
			<freetext3></freetext3>
			<subarticle></subarticle>
			<unitspriceexcl>0.00</unitspriceexcl>
			<units>1</units>
			<vatcode name="BTW 21%" shortname="V 21%">VH</vatcode>
			<allowdiscountorpremium>true</allowdiscountorpremium>
			<performancedate /><performancetype />
			<dim1 name="Overige" shortname="Overige">4009</dim1>
			<valueexcl>0.00</valueexcl>
			<vatvalue>0.00</vatvalue>
			<valueinc>0.00</valueinc>
		</line>
	</lines>
	<totals>
		<valueexcl>0.00</valueexcl>
		<valueinc>0.00</valueinc>
	</totals>
	<vatlines>
		<vatline>
			<vatcode name="BTW 21%" shortname="V 21%" percentage="21.000000000">VH</vatcode>
			<vatvalue>0.00</vatvalue>
			<performancetype></performancetype>
			<performancedate></performancedate>
		</vatline>
	</vatlines>
</salesinvoice>
